; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-6packages-1093seed

(define (problem transport-three-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-6packages-1093seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 610,401 -> 347,675
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 38)
  ; 347,675 -> 610,401
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 38)
  ; 731,914 -> 347,675
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 46)
  ; 347,675 -> 731,914
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 46)
  ; 731,914 -> 610,401
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 53)
  ; 610,401 -> 731,914
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 53)
  ; 383,996 -> 347,675
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 33)
  ; 347,675 -> 383,996
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 33)
  ; 383,996 -> 610,401
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 64)
  ; 610,401 -> 383,996
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 64)
  ; 383,996 -> 731,914
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 36)
  ; 731,914 -> 383,996
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 36)
  ; 2499,849 -> 2160,462
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 52)
  ; 2160,462 -> 2499,849
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 52)
  ; 2602,565 -> 2160,462
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 46)
  ; 2160,462 -> 2602,565
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 46)
  ; 2602,565 -> 2694,2
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 57)
  ; 2694,2 -> 2602,565
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 57)
  ; 2602,565 -> 2499,849
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 31)
  ; 2499,849 -> 2602,565
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 31)
  ; 1179,2613 -> 1539,2875
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 45)
  ; 1539,2875 -> 1179,2613
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 45)
  ; 1089,2705 -> 1539,2875
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 49)
  ; 1539,2875 -> 1089,2705
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 49)
  ; 1089,2705 -> 1179,2613
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 13)
  ; 1179,2613 -> 1089,2705
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 13)
  ; 1247,2505 -> 1539,2875
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 48)
  ; 1539,2875 -> 1247,2505
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 48)
  ; 1247,2505 -> 1179,2613
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 13)
  ; 1179,2613 -> 1247,2505
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 13)
  ; 1247,2505 -> 1089,2705
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 26)
  ; 1089,2705 -> 1247,2505
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 26)
  ; 731,914 <-> 2160,462
  (road city-1-loc-3 city-2-loc-1)
  (= (road-length city-1-loc-3 city-2-loc-1) 150)
  (road city-2-loc-1 city-1-loc-3)
  (= (road-length city-2-loc-1 city-1-loc-3) 150)
  (road city-1-loc-4 city-3-loc-4)
  (= (road-length city-1-loc-4 city-3-loc-4) 227)
  (road city-3-loc-4 city-1-loc-4)
  (= (road-length city-3-loc-4 city-1-loc-4) 227)
  (road city-2-loc-2 city-3-loc-3)
  (= (road-length city-2-loc-2 city-3-loc-3) 195)
  (road city-3-loc-3 city-2-loc-2)
  (= (road-length city-3-loc-3 city-2-loc-2) 195)
  (at package-1 city-2-loc-2)
  (at package-2 city-3-loc-2)
  (at package-3 city-3-loc-3)
  (at package-4 city-1-loc-3)
  (at package-5 city-1-loc-3)
  (at package-6 city-3-loc-3)
  (at truck-1 city-3-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-1-loc-3)
  (at package-2 city-3-loc-3)
  (at package-3 city-2-loc-3)
  (at package-4 city-3-loc-3)
  (at package-5 city-3-loc-1)
  (at package-6 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 6
2. (pick-up truck-2 city-1-loc-3 package-5 capacity-3 capacity-4)
   deleted: (at package-5 city-1-loc-3) (capacity truck-2 capacity-4)
   added: (in package-5 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 6
3. (pick-up truck-2 city-1-loc-3 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-3) (capacity truck-2 capacity-3)
   added: (in package-4 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 6
4. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 6
5. (drive truck-2 city-1-loc-4 city-3-loc-4)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-3-loc-4)
   goals met: 0 of 6
6. (drive truck-2 city-3-loc-4 city-3-loc-2)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-2)
   goals met: 0 of 6
7. (pick-up truck-2 city-3-loc-2 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-3-loc-2) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 6
8. (drive truck-2 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-1)
   goals met: 0 of 6
9. (drop truck-2 city-3-loc-1 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-1)
   added: (at package-5 city-3-loc-1) (capacity truck-2 capacity-2)
   goals met: 1 of 6
10. (drive truck-2 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-3-loc-3)
   goals met: 1 of 6
11. (pick-up truck-2 city-3-loc-3 package-6 capacity-1 capacity-2)
   deleted: (at package-6 city-3-loc-3) (capacity truck-2 capacity-2)
   added: (in package-6 truck-2) (capacity truck-2 capacity-1)
   goals met: 1 of 6
12. (pick-up truck-2 city-3-loc-3 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-3-loc-3) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 6
13. (drop truck-2 city-3-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-3-loc-3) (capacity truck-2 capacity-1)
   goals met: 2 of 6
14. (drop truck-2 city-3-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-3-loc-3) (capacity truck-2 capacity-2)
   goals met: 3 of 6
15. (drive truck-2 city-3-loc-3 city-2-loc-2)
   deleted: (at truck-2 city-3-loc-3)
   added: (at truck-2 city-2-loc-2)
   goals met: 3 of 6
16. (pick-up truck-2 city-2-loc-2 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-2-loc-2) (capacity truck-2 capacity-2)
   added: (in package-1 truck-2) (capacity truck-2 capacity-1)
   goals met: 3 of 6
17. (drive truck-2 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-4)
   goals met: 3 of 6
18. (drive truck-2 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-3)
   goals met: 3 of 6
19. (drop truck-2 city-2-loc-3 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 4 of 6
20. (drop truck-2 city-2-loc-3 package-6 capacity-2 capacity-3)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-2)
   added: (at package-6 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 5 of 6
21. (drive truck-2 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-1)
   goals met: 5 of 6
22. (drive truck-2 city-2-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 5 of 6
23. (drop truck-2 city-1-loc-3 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-3)
   added: (at package-1 city-1-loc-3) (capacity truck-2 capacity-4)
   goals met: 6 of 6
